InformationRegisters/ИсполнителиПоДенежнымСредствамБрокерские.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиПоДенежнымСредствамБрокерские</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыСчетовДоверительногоУправленияУБрокеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыСчетовДоверительногоУправленияУБрокеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодFORTS</Name>
					<Comment>Код счета д/у на рынке Forts</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнойБрокер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБрокерскогоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсполнителиПоДенежнымСредствамБрокерские/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ДоговорБрокерскогоОбслуживания = ПолучитьДоговорБрокерскогоОбслуживания(Запись.Организация, Запись.СчетДоверительногоУправления, Запись.Брокер);
		
		Если Не ЗначениеЗаполнено(ДоговорБрокерскогоОбслуживания) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета д/у «" + Строка(Запись.СчетДоверительногоУправления) + "» не зарегистрирован договор с брокером «" + Строка(Запись.Брокер) + "»",,,, Отказ);
			
		Иначе
			
			// проверим дату расторжения договора 
			// #ТехническийДолг Был неявный запрос в цикле, стал явный. Проверку дат вынести в отдельную процедуру, пример в УсловияДоговоровОбщие
			РеквизитыДоговора = РаботаСНормативноСправочнойИнформацией.ПолучитьРеквизитыДоговора(ДоговорБрокерскогоОбслуживания, "ДатаРасторжения");
			Если ЗначениеЗаполнено(РеквизитыДоговора.ДатаРасторжения)
				И (Запись.ДатаЗакрытия > РеквизитыДоговора.ДатаРасторжения ИЛИ Не ЗначениеЗаполнено(Запись.ДатаЗакрытия))
			Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия исполнителя «" + Строка(Запись.СчетДоверительногоУправления) + "» по счету брокера «" + Строка(Запись.РасчетныйСчет) + "» не должна быть позднее даты расторжения договора.", ЭтотОбъект, "ДатаЗакрытия",, Отказ);
			КонецЕсли;
		
		КонецЕсли;
		
		// т.к. нам глубоко до лампочки, когда там брокер закрывает свои счета,
		// проверять дату их закрытия нам не интересно
		
		// т.к. брокер может учитывать активы не на собственных счетах (например, Т+
		// на ММВБ у БК РЕГИОН), то проверять владельца р/счета бессмысленно
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Функция ПолучитьДоговорБрокерскогоОбслуживания(Организация, СчетДоверительногоУправления, Брокер)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеров.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеров");

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Брокер", Брокер);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	    Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].ДоговорБрокерскогоОбслуживания; 	
	
КонецФункции
